<template>
  <Demo :code="code">
    <div class="demo-wrapper">
      <div class="demo-item">
        <h3>基础用法</h3>
        <s-text-more
          text="这是一段很长的文本，超过三行会自动折叠。这是一段很长的文本，超过三行会自动折叠。这是一段很长的文本，超过三行会自动折叠。这是一段很长的文本，超过三行会自动折叠。这是一段很长的文本，超过三行会自动折叠。这是一段很长的文本，超过三行会自动折叠。这是一段很长的文本，超过三行会自动折叠。这是一段很长的文本，超过三行会自动折叠。"
        />
      </div>

      <div class="demo-item">
        <h3>自定义行数:2</h3>
        <s-text-more
          :rows="2"
          text="这是一段很长的文本，超过两行会自动折叠。这是一段很长的文本，超过两行会自动折叠。这是一段很长的文本，超过两行会自动折叠。这是一段很长的文本，超过两行会自动折叠。这是一段很长的文本，超过两行会自动折叠。这是一段很长的文本，超过两行会自动折叠。这是一段很长的文本，超过两行会自动折叠。这是一段很长的文本，超过两行会自动折叠。"
        />
      </div>
    </div>
  </Demo>
</template>

<script setup lang="ts">
const code = `<template>
  <!-- 基础用法 -->
  <s-text-more
    text="这是一段很长的文本，超过三行会自动折叠。这是一段很长的文本，超过三行会自动折叠。这是一段很长的文本，超过三行会自动折叠。这是一段很长的文本，超过三行会自动折叠。这是一段很长的文本，超过三行会自动折叠。这是一段很长的文本，超过三行会自动折叠。这是一段很长的文本，超过三行会自动折叠。这是一段很长的文本，超过三行会自动折叠。"
  />

  <!-- 自定义行数 -->
  <s-text-more
    :rows="2"
    text="这是一段很长的文本，超过两行会自动折叠。这是一段很长的文本，超过两行会自动折叠。这是一段很长的文本，超过两行会自动折叠。这是一段很长的文本，超过两行会自动折叠。这是一段很长的文本，超过两行会自动折叠。这是一段很长的文本，超过两行会自动折叠。这是一段很长的文本，超过两行会自动折叠。这是一段很长的文本，超过两行会自动折叠。"
  />
</template>`
</script>

<style scoped lang="less">
.demo-wrapper {
  width: 100%;
  background: #fff;
  border-radius: 4px;

  .demo-item {
    margin-bottom: 24px;

    &:last-child {
      margin-bottom: 0;
    }

    h3 {
      margin-top: 10px;
      margin-bottom: 16px;
      font-size: 14px;
      color: #666;
    }
  }
}
</style> 